MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4NNF15FG/mcu.h
/**
  * @brief Watchdog Timer (SIWDT)
  */
typedef struct
{
  __IO uint32_t PRO;               /*!< SIWDT Protect Register                       */
  __IO uint32_t EN;                /*!< SIWDT Enable Register                        */
  __O  uint32_t CR;                /*!< SIWDT Control Register                       */
  __IO uint32_t MOD;               /*!< SIWDT Mode Register                          */
  __I  uint32_t MONI;              /*!< SIWDT Count Monitor Register                 */
} TSB_SIWD_TypeDef;

/**
  * @brief NBDIF
  */
typedef struct
{
  __IO uint32_t CR0;               /*!< NBDIF control register 0                     */
  __IO uint32_t CR1;               /*!< NBDIF control register 1                     */
} TSB_NBD_TypeDef;

/**
  * @brief Malti Porpose Direct Memory Accsess(MDMA)
  */
typedef struct
{
       uint32_t RESERVED0;
  __IO uint32_t CEN;               /*!< MDMA Transfer Channel Enable Register        */
  __IO uint32_t REQ;               /*!< MDMA Transfer Request Register               */
  __IO uint32_t SUS;               /*!< MDMA Transfer Suspension Register            */
  __IO uint32_t ACT;               /*!< MDMA Transfer Active Register                */
  __IO uint32_t END;               /*!< MDMA Transfer End Register                   */
  __IO uint32_t PRI;               /*!< MDMA Transfer Priority Setting Register      */
  __IO uint32_t ENE;               /*!< MDMA Transfer Completion Interrupt Enable Register*/
  __IO uint32_t DTAB;              /*!< MDMA Transfer Descriptor Table Start Address Register*/
       uint32_t RESERVED1;
  __I  uint32_t CHN;               /*!< MDMA Transfer Execution Channel Number Register*/
  __I  uint32_t XFTYP;             /*!< MDMA Transfer Type Register                  */
  __I  uint32_t XFSAD;             /*!< MDMA Transfer Source Address Register        */
  __I  uint32_t XFDAD;             /*!< MDMA Transfer Destination Address Register   */
  __I  uint32_t XFSIZ;             /*!< MDMA Transfer Size Register                  */
  __I  uint32_t DSADS;             /*!< MDMA Transfer Descriptor Storage Address Register*/
  __I  uint32_t DSNUM;             /*!< MDMA Transfer Descriptor Count Register      */
       uint32_t RESERVED2;
  __IO uint32_t DEND;              /*!< MDMA Descriptor End Register                 */
  __IO uint32_t DENE;              /*!< MDMA Descriptor Completion Interrupt Enable Register*/
  __I  uint32_t C00XFTYP;          /*!< MDMA ch 00 Transfer Type Saving Register     */
  __I  uint32_t C00XFSAD;          /*!< MDMA ch 00 Transfer Source Address Saving Register*/
  __I  uint32_t C00XFDAD;          /*!< MDMA ch 00 Transfer Destination Address Saving Register*/
  __I  uint32_t C00XFSIZ;          /*!< MDMA ch 00 Transfer Size Saving Register     */
  __I  uint32_t C00DSADS;          /*!< MDMA ch 00 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C00DSNUM;          /*!< MDMA ch 00 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED3[2];
  __I  uint32_t C01XFTYP;          /*!< MDMA ch 01 Transfer Type Saving Register     */
  __I  uint32_t C01XFSAD;          /*!< MDMA ch 01 Transfer Source Address Saving Register*/
  __I  uint32_t C01XFDAD;          /*!< MDMA ch 01 Transfer Destination Address Saving Register*/
  __I  uint32_t C01XFSIZ;          /*!< MDMA ch 01 Transfer Size Saving Register     */
  __I  uint32_t C01DSADS;          /*!< MDMA ch 01 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C01DSNUM;          /*!< MDMA ch 01 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED4[2];
  __I  uint32_t C02XFTYP;          /*!< MDMA ch 02 Transfer Type Saving Register     */
  __I  uint32_t C02XFSAD;          /*!< MDMA ch 02 Transfer Source Address Saving Register*/
  __I  uint32_t C02XFDAD;          /*!< MDMA ch 02 Transfer Destination Address Saving Register*/
  __I  uint32_t C02XFSIZ;          /*!< MDMA ch 02 Transfer Size Saving Register     */
  __I  uint32_t C02DSADS;          /*!< MDMA ch 02 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C02DSNUM;          /*!< MDMA ch 02 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED5[2];
  __I  uint32_t C03XFTYP;          /*!< MDMA ch 03 Transfer Type Saving Register     */
  __I  uint32_t C03XFSAD;          /*!< MDMA ch 03 Transfer Source Address Saving Register*/
  __I  uint32_t C03XFDAD;          /*!< MDMA ch 03 Transfer Destination Address Saving Register*/
  __I  uint32_t C03XFSIZ;          /*!< MDMA ch 03 Transfer Size Saving Register     */
  __I  uint32_t C03DSADS;          /*!< MDMA ch 03 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C03DSNUM;          /*!< MDMA ch 03 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED6[2];
  __I  uint32_t C04XFTYP;          /*!< MDMA ch 04 Transfer Type Saving Register     */
  __I  uint32_t C04XFSAD;          /*!< MDMA ch 04 Transfer Source Address Saving Register*/
  __I  uint32_t C04XFDAD;          /*!< MDMA ch 04 Transfer Destination Address Saving Register*/
  __I  uint32_t C04XFSIZ;          /*!< MDMA ch 04 Transfer Size Saving Register     */
  __I  uint32_t C04DSADS;          /*!< MDMA ch 04 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C04DSNUM;          /*!< MDMA ch 04 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED7[2];
  __I  uint32_t C05XFTYP;          /*!< MDMA ch 05 Transfer Type Saving Register     */
  __I  uint32_t C05XFSAD;          /*!< MDMA ch 05 Transfer Source Address Saving Register*/
  __I  uint32_t C05XFDAD;          /*!< MDMA ch 05 Transfer Destination Address Saving Register*/
  __I  uint32_t C05XFSIZ;          /*!< MDMA ch 05 Transfer Size Saving Register     */
  __I  uint32_t C05DSADS;          /*!< MDMA ch 05 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C05DSNUM;          /*!< MDMA ch 05 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED8[2];
  __I  uint32_t C06XFTYP;          /*!< MDMA ch 06 Transfer Type Saving Register     */
  __I  uint32_t C06XFSAD;          /*!< MDMA ch 06 Transfer Source Address Saving Register*/
  __I  uint32_t C06XFDAD;          /*!< MDMA ch 06 Transfer Destination Address Saving Register*/
  __I  uint32_t C06XFSIZ;          /*!< MDMA ch 06 Transfer Size Saving Register     */
  __I  uint32_t C06DSADS;          /*!< MDMA ch 06 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C06DSNUM;          /*!< MDMA ch 06 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED9[2];
  __I  uint32_t C07XFTYP;          /*!< MDMA ch 07 Transfer Type Saving Register     */
  __I  uint32_t C07XFSAD;          /*!< MDMA ch 07 Transfer Source Address Saving Register*/
  __I  uint32_t C07XFDAD;          /*!< MDMA ch 07 Transfer Destination Address Saving Register*/
  __I  uint32_t C07XFSIZ;          /*!< MDMA ch 07 Transfer Size Saving Register     */
  __I  uint32_t C07DSADS;          /*!< MDMA ch 07 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C07DSNUM;          /*!< MDMA ch 07 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED10[2];
  __I  uint32_t C08XFTYP;          /*!< MDMA ch 08 Transfer Type Saving Register     */
  __I  uint32_t C08XFSAD;          /*!< MDMA ch 08 Transfer Source Address Saving Register*/
  __I  uint32_t C08XFDAD;          /*!< MDMA ch 08 Transfer Destination Address Saving Register*/
  __I  uint32_t C08XFSIZ;          /*!< MDMA ch 08 Transfer Size Saving Register     */
  __I  uint32_t C08DSADS;          /*!< MDMA ch 08 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C08DSNUM;          /*!< MDMA ch 08 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED11[2];
  __I  uint32_t C09XFTYP;          /*!< MDMA ch n Transfer Type Saving Register      */
  __I  uint32_t C09XFSAD;          /*!< MDMA ch n Transfer Source Address Saving Register*/
  __I  uint32_t C09XFDAD;          /*!< MDMA ch n Transfer Destination Address Saving Register*/
  __I  uint32_t C09XFSIZ;          /*!< MDMA ch n Transfer Size Saving Register      */
  __I  uint32_t C09DSADS;          /*!< MDMA ch n Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C09DSNUM;          /*!< MDMA ch n Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED12[2];
  __I  uint32_t C10XFTYP;          /*!< MDMA ch 10 Transfer Type Saving Register     */
  __I  uint32_t C10XFSAD;          /*!< MDMA ch 10 Transfer Source Address Saving Register*/
  __I  uint32_t C10XFDAD;          /*!< MDMA ch 10 Transfer Destination Address Saving Register*/
  __I  uint32_t C10XFSIZ;          /*!< MDMA ch 10 Transfer Size Saving Register     */
  __I  uint32_t C10DSADS;          /*!< MDMA ch 10 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C10DSNUM;          /*!< MDMA ch 10 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED13[2];
  __I  uint32_t C11XFTYP;          /*!< MDMA ch 11 Transfer Type Saving Register     */
  __I  uint32_t C11XFSAD;          /*!< MDMA ch 11 Transfer Source Address Saving Register*/
  __I  uint32_t C11XFDAD;          /*!< MDMA ch 11 Transfer Destination Address Saving Register*/
  __I  uint32_t C11XFSIZ;          /*!< MDMA ch 11 Transfer Size Saving Register     */
  __I  uint32_t C11DSADS;          /*!< MDMA ch 11 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C11DSNUM;          /*!< MDMA ch 11 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED14[2];
  __I  uint32_t C12XFTYP;          /*!< MDMA ch 12 Transfer Type Saving Register     */
  __I  uint32_t C12XFSAD;          /*!< MDMA ch 12 Transfer Source Address Saving Register*/
  __I  uint32_t C12XFDAD;          /*!< MDMA ch 12 Transfer Destination Address Saving Register*/
  __I  uint32_t C12XFSIZ;          /*!< MDMA ch 12 Transfer Size Saving Register     */
  __I  uint32_t C12DSADS;          /*!< MDMA ch 12 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C12DSNUM;          /*!< MDMA ch 12 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED15[2];
  __I  uint32_t C13XFTYP;          /*!< MDMA ch 13 Transfer Type Saving Register     */
  __I  uint32_t C13XFSAD;          /*!< MDMA ch 13 Transfer Source Address Saving Register*/
  __I  uint32_t C13XFDAD;          /*!< MDMA ch 13 Transfer Destination Address Saving Register*/
  __I  uint32_t C13XFSIZ;          /*!< MDMA ch 13 Transfer Size Saving Register     */
  __I  uint32_t C13DSADS;          /*!< MDMA ch 13 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C13DSNUM;          /*!< MDMA ch 13 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED16[2];
  __I  uint32_t C14XFTYP;          /*!< MDMA ch 14 Transfer Type Saving Register     */
  __I  uint32_t C14XFSAD;          /*!< MDMA ch 14 Transfer Source Address Saving Register*/
  __I  uint32_t C14XFDAD;          /*!< MDMA ch 14 Transfer Destination Address Saving Register*/
  __I  uint32_t C14XFSIZ;          /*!< MDMA ch 14 Transfer Size Saving Register     */
  __I  uint32_t C14DSADS;          /*!< MDMA ch 14 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C14DSNUM;          /*!< MDMA ch 14 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED17[2];
  __I  uint32_t C15XFTYP;          /*!< MDMA ch 15 Transfer Type Saving Register     */
  __I  uint32_t C15XFSAD;          /*!< MDMA ch 15 Transfer Source Address Saving Register*/
  __I  uint32_t C15XFDAD;          /*!< MDMA ch 15 Transfer Destination Address Saving Register*/
  __I  uint32_t C15XFSIZ;          /*!< MDMA ch 15 Transfer Size Saving Register     */
  __I  uint32_t C15DSADS;          /*!< MDMA ch 15 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C15DSNUM;          /*!< MDMA ch 15 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED18[2];
  __I  uint32_t C16XFTYP;          /*!< MDMA ch 16 Transfer Type Saving Register     */
  __I  uint32_t C16XFSAD;          /*!< MDMA ch 16 Transfer Source Address Saving Register*/
  __I  uint32_t C16XFDAD;          /*!< MDMA ch 16 Transfer Destination Address Saving Register*/
  __I  uint32_t C16XFSIZ;          /*!< MDMA ch 16 Transfer Size Saving Register     */
  __I  uint32_t C16DSADS;          /*!< MDMA ch 16 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C16DSNUM;          /*!< MDMA ch 16 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED19[2];
  __I  uint32_t C17XFTYP;          /*!< MDMA ch 17 Transfer Type Saving Register     */
  __I  uint32_t C17XFSAD;          /*!< MDMA ch 17 Transfer Source Address Saving Register*/
  __I  uint32_t C17XFDAD;          /*!< MDMA ch 17 Transfer Destination Address Saving Register*/
  __I  uint32_t C17XFSIZ;          /*!< MDMA ch 17 Transfer Size Saving Register     */
  __I  uint32_t C17DSADS;          /*!< MDMA ch 17 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C17DSNUM;          /*!< MDMA ch 17 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED20[2];
  __I  uint32_t C18XFTYP;          /*!< MDMA ch 18 Transfer Type Saving Register     */
  __I  uint32_t C18XFSAD;          /*!< MDMA ch 18 Transfer Source Address Saving Register*/
  __I  uint32_t C18XFDAD;          /*!< MDMA ch 18 Transfer Destination Address Saving Register*/
  __I  uint32_t C18XFSIZ;          /*!< MDMA ch 18 Transfer Size Saving Register     */
  __I  uint32_t C18DSADS;          /*!< MDMA ch 18 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C18DSNUM;          /*!< MDMA ch 18 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED21[2];
  __I  uint32_t C19XFTYP;          /*!< MDMA ch 19 Transfer Type Saving Register     */
  __I  uint32_t C19XFSAD;          /*!< MDMA ch 19 Transfer Source Address Saving Register*/
  __I  uint32_t C19XFDAD;          /*!< MDMA ch 19 Transfer Destination Address Saving Register*/
  __I  uint32_t C19XFSIZ;          /*!< MDMA ch 19 Transfer Size Saving Register     */
  __I  uint32_t C19DSADS;          /*!< MDMA ch 19 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C19DSNUM;          /*!< MDMA ch 19 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED22[2];
  __I  uint32_t C20XFTYP;          /*!< MDMA ch 20 Transfer Type Saving Register     */
  __I  uint32_t C20XFSAD;          /*!< MDMA ch 20 Transfer Source Address Saving Register*/
  __I  uint32_t C20XFDAD;          /*!< MDMA ch 20 Transfer Destination Address Saving Register*/
  __I  uint32_t C20XFSIZ;          /*!< MDMA ch 20 Transfer Size Saving Register     */
  __I  uint32_t C20DSADS;          /*!< MDMA ch 20 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C20DSNUM;          /*!< MDMA ch 20 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED23[2];
  __I  uint32_t C21XFTYP;          /*!< MDMA ch 21 Transfer Type Saving Register     */
  __I  uint32_t C21XFSAD;          /*!< MDMA ch 21 Transfer Source Address Saving Register*/
  __I  uint32_t C21XFDAD;          /*!< MDMA ch 21 Transfer Destination Address Saving Register*/
  __I  uint32_t C21XFSIZ;          /*!< MDMA ch 21 Transfer Size Saving Register     */
  __I  uint32_t C21DSADS;          /*!< MDMA ch 21 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C21DSNUM;          /*!< MDMA ch 21 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED24[2];
  __I  uint32_t C22XFTYP;          /*!< MDMA ch 22 Transfer Type Saving Register     */
  __I  uint32_t C22XFSAD;          /*!< MDMA ch 22 Transfer Source Address Saving Register*/
  __I  uint32_t C22XFDAD;          /*!< MDMA ch 22 Transfer Destination Address Saving Register*/
  __I  uint32_t C22XFSIZ;          /*!< MDMA ch 22 Transfer Size Saving Register     */
  __I  uint32_t C22DSADS;          /*!< MDMA ch 22 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C22DSNUM;          /*!< MDMA ch 22 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED25[2];
  __I  uint32_t C23XFTYP;          /*!< MDMA ch 23 Transfer Type Saving Register     */
  __I  uint32_t C23XFSAD;          /*!< MDMA ch 23 Transfer Source Address Saving Register*/
  __I  uint32_t C23XFDAD;          /*!< MDMA ch 23 Transfer Destination Address Saving Register*/
  __I  uint32_t C23XFSIZ;          /*!< MDMA ch 23 Transfer Size Saving Register     */
  __I  uint32_t C23DSADS;          /*!< MDMA ch 23 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C23DSNUM;          /*!< MDMA ch 23 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED26[2];
  __I  uint32_t C24XFTYP;          /*!< MDMA ch 24 Transfer Type Saving Register     */
  __I  uint32_t C24XFSAD;          /*!< MDMA ch 24 Transfer Source Address Saving Register*/
  __I  uint32_t C24XFDAD;          /*!< MDMA ch 24 Transfer Destination Address Saving Register*/
  __I  uint32_t C24XFSIZ;          /*!< MDMA ch 24 Transfer Size Saving Register     */
  __I  uint32_t C24DSADS;          /*!< MDMA ch 24 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C24DSNUM;          /*!< MDMA ch 24 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED27[2];
  __I  uint32_t C25XFTYP;          /*!< MDMA ch 25 Transfer Type Saving Register     */
  __I  uint32_t C25XFSAD;          /*!< MDMA ch 25 Transfer Source Address Saving Register*/
  __I  uint32_t C25XFDAD;          /*!< MDMA ch 25 Transfer Destination Address Saving Register*/
  __I  uint32_t C25XFSIZ;          /*!< MDMA ch 25 Transfer Size Saving Register     */
  __I  uint32_t C25DSADS;          /*!< MDMA ch 25 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C25DSNUM;          /*!< MDMA ch 25 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED28[2];
  __I  uint32_t C26XFTYP;          /*!< MDMA ch 26 Transfer Type Saving Register     */
  __I  uint32_t C26XFSAD;          /*!< MDMA ch 26 Transfer Source Address Saving Register*/
  __I  uint32_t C26XFDAD;          /*!< MDMA ch 26 Transfer Destination Address Saving Register*/
  __I  uint32_t C26XFSIZ;          /*!< MDMA ch 26 Transfer Size Saving Register     */
  __I  uint32_t C26DSADS;          /*!< MDMA ch 26 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C26DSNUM;          /*!< MDMA ch 26 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED29[2];
  __I  uint32_t C27XFTYP;          /*!< MDMA ch 27 Transfer Type Saving Register     */
  __I  uint32_t C27XFSAD;          /*!< MDMA ch 27 Transfer Source Address Saving Register*/
  __I  uint32_t C27XFDAD;          /*!< MDMA ch 27 Transfer Destination Address Saving Register*/
  __I  uint32_t C27XFSIZ;          /*!< MDMA ch 27 Transfer Size Saving Register     */
  __I  uint32_t C27DSADS;          /*!< MDMA ch 27 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C27DSNUM;          /*!< MDMA ch 27 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED30[2];
  __I  uint32_t C28XFTYP;          /*!< MDMA ch 28 Transfer Type Saving Register     */
  __I  uint32_t C28XFSAD;          /*!< MDMA ch 28 Transfer Source Address Saving Register*/
  __I  uint32_t C28XFDAD;          /*!< MDMA ch 28 Transfer Destination Address Saving Register*/
  __I  uint32_t C28XFSIZ;          /*!< MDMA ch 28 Transfer Size Saving Register     */
  __I  uint32_t C28DSADS;          /*!< MDMA ch 28 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C28DSNUM;          /*!< MDMA ch 28 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED31[2];
  __I  uint32_t C29XFTYP;          /*!< MDMA ch 29 Transfer Type Saving Register     */
  __I  uint32_t C29XFSAD;          /*!< MDMA ch 29 Transfer Source Address Saving Register*/
  __I  uint32_t C29XFDAD;          /*!< MDMA ch 29 Transfer Destination Address Saving Register*/
  __I  uint32_t C29XFSIZ;          /*!< MDMA ch 29 Transfer Size Saving Register     */
  __I  uint32_t C29DSADS;          /*!< MDMA ch 29 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C29DSNUM;          /*!< MDMA ch 29 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED32[2];
  __I  uint32_t C30XFTYP;          /*!< MDMA ch 30 Transfer Type Saving Register     */
  __I  uint32_t C30XFSAD;          /*!< MDMA ch 30 Transfer Source Address Saving Register*/
  __I  uint32_t C30XFDAD;          /*!< MDMA ch 30 Transfer Destination Address Saving Register*/
  __I  uint32_t C30XFSIZ;          /*!< MDMA ch 30 Transfer Size Saving Register     */
  __I  uint32_t C30DSADS;          /*!< MDMA ch 30 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C30DSNUM;          /*!< MDMA ch 30 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED33[2];
  __I  uint32_t C31XFTYP;          /*!< MDMA ch 31 Transfer Type Saving Register     */
  __I  uint32_t C31XFSAD;          /*!< MDMA ch 31 Transfer Source Address Saving Register*/
  __I  uint32_t C31XFDAD;          /*!< MDMA ch 31 Transfer Destination Address Saving Register*/
  __I  uint32_t C31XFSIZ;          /*!< MDMA ch 31 Transfer Size Saving Register     */
  __I  uint32_t C31DSADS;          /*!< MDMA ch 31 Transfer Descriptor Storage Address Saving Register*/
  __I  uint32_t C31DSNUM;          /*!< MDMA ch 31 Transfer Descriptor Count Saving Register*/
       uint32_t RESERVED34[238];
  __IO uint32_t MSK;               /*!< MDMA Transfer Request Mask Register          */
} TSB_MDMA_TypeDef;

#if defined ( __CC_ARM   )           /* RealView Compiler */
#pragma anon_unions
#elif (defined (__ICCARM__))         /*  ICC Compiler     */
#pragma language=extended
#endif

/**
  * @brief ARM Prime Cell PL011
  */
typedef struct
{
  __IO uint32_t DR;                /*!< FUART Data Register                          */
union {
  __I  uint32_t RSR;               /*!< FUART Receive Status Register                */
  __O  uint32_t ECR;               /*!< FUART Error Clear Register                   */
  };
       uint32_t RESERVED0[4];
  __I  uint32_t FR;                /*!< FUART Flag Register                          */
       uint32_t RESERVED1;
  __IO uint32_t ILPR;              /*!< FUART IrDA Low-power Counter register        */
  __IO uint32_t BRD;               /*!< FUART Integer Baud Rate Register             */
  __IO uint32_t FBRD;              /*!< FUART Fractional Baud Rate Register          */
  __IO uint32_t LCR_H;             /*!< FUART Line Control Register                  */
  __IO uint32_t CR;                /*!< FUART Cntrol Register                        */
  __IO uint32_t IFLS;              /*!< FUART Interrupt FIFO Level Select Register   */
  __IO uint32_t IMSC;              /*!< FUART Interrupt Mask Set/Clear Register      */
  __I  uint32_t RIS;               /*!< FUART Raw Interrupt Status Register          */
  __I  uint32_t MIS;               /*!< FUART Masked Interrupt Status Register       */
  __O  uint32_t ICR;               /*!< FUART Interrupt Clear Register               */
  __IO uint32_t DMACR;             /*!< FUART DMA Control Register                   */
} TSB_FURT_TypeDef;

